df -> column -> method -> function

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("D:\\1745501008647-data_cleaning_sample.csv")

In [3]:
df.head()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019

In [4]:
df.isnull().sum()

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [5]:
df['Age']

0    25.0
1     NaN
2    30.0
3     NaN
4    22.0
5    28.0
6    25.0
7    25.0
8     NaN
Name: Age, dtype: float64

In [6]:
df.dropna(axis=0)

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12-11-2019
6  Alice  25.0     New York      F  alice@example.com  01-05-2021
7  Alice  25.0     New York      F  alice@example.com  01-05-2021

In [7]:
df.fillna(0)

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5        0  28.0        Delhi      F     eve@domain.com           0
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   0.0        Delhi      M    charlie@example  20-07-2021

In [8]:
df['Age'] = df['Age'].fillna(df['Age']).mean()

In [28]:
df['Age'] = df['Age'].astype(int)

In [29]:
df

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   25        Delhi      M    charlie@example  20-07-2021
2      Bob   25  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   25        Delhi      M    charlie@example  20-07-2021
4    David   25       Mumbai      M  david@example.com  12-11-2019
5      NaN   25        Delhi      F     eve@domain.com         NaN
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   25        Delhi      M    charlie@example  20-07-2021

In [30]:
df.fillna(method='ffill')

C:\Users\91766\AppData\Local\Temp\ipykernel_10300\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   25        Delhi      M    charlie@example  20-07-2021
2      Bob   25  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   25        Delhi      M    charlie@example  20-07-2021
4    David   25       Mumbai      M  david@example.com  12-11-2019
5    David   25        Delhi      F     eve@domain.com  12-11-2019
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   25        Delhi      M    charlie@example  20-07-2021

In [32]:
df.fillna(method='bfill')

C:\Users\91766\AppData\Local\Temp\ipykernel_10300\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   25        Delhi      M    charlie@example  20-07-2021
2      Bob   25  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   25        Delhi      M    charlie@example  20-07-2021
4    David   25       Mumbai      M  david@example.com  12-11-2019
5    Alice   25        Delhi      F     eve@domain.com  01-05-2021
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   25        Delhi      M    charlie@example  20-07-2021

In [12]:
df.ffill()

      Name        Age         City Gender              Email   Join Date
0    Alice  25.833333     New York      F  alice@example.com  01-05-2021
1  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021
2      Bob  25.833333  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021
4    David  25.833333       Mumbai      M  david@example.com  12-11-2019
5    David  25.833333        Delhi      F     eve@domain.com  12-11-2019
6    Alice  25.833333     New York      F  alice@example.com  01-05-2021
7    Alice  25.833333     New York      F  alice@example.com  01-05-2021
8  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021

In [13]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [14]:
df.drop_duplicates()

      Name        Age         City Gender              Email   Join Date
0    Alice  25.833333     New York      F  alice@example.com  01-05-2021
1  Charlie  25.833333        Delhi      M    charlie@example  20-07-2021
2      Bob  25.833333  Los Angeles      M    bob@example.com  15-06-2020
4    David  25.833333       Mumbai      M  david@example.com  12-11-2019
5      NaN  25.833333        Delhi      F     eve@domain.com         NaN

In [15]:
df.duplicated(subset=['Name','Age'])

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [16]:
df['Name'].str.lower()

0      alice
1    charlie
2        bob
3    charlie
4      david
5        NaN
6      alice
7      alice
8    charlie
Name: Name, dtype: object

In [17]:
df['Name'].str.upper()

0      ALICE
1    CHARLIE
2        BOB
3    CHARLIE
4      DAVID
5        NaN
6      ALICE
7      ALICE
8    CHARLIE
Name: Name, dtype: object

In [18]:
df['Name'].str.title()

0      Alice
1    Charlie
2        Bob
3    Charlie
4      David
5        NaN
6      Alice
7      Alice
8    Charlie
Name: Name, dtype: object

In [19]:
df['City'].str.contains('delhi',case= False)

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7    False
8     True
Name: City, dtype: bool

In [20]:
df['Email'].str.split('@')

0    [alice, example.com]
1      [charlie, example]
2      [bob, example.com]
3      [charlie, example]
4    [david, example.com]
5       [eve, domain.com]
6    [alice, example.com]
7    [alice, example.com]
8      [charlie, example]
Name: Email, dtype: object

In [21]:
df2 = df.dropna().copy()

In [22]:
df2['Age'] = df2['Age'].astype(int)

In [23]:
df2

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie   25        Delhi      M    charlie@example  20-07-2021
2      Bob   25  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   25        Delhi      M    charlie@example  20-07-2021
4    David   25       Mumbai      M  david@example.com  12-11-2019
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie   25        Delhi      M    charlie@example  20-07-2021

In [24]:
df2['Age group'] = df2['Age'].apply(lambda x: 'Adult' if x>=18 else 'teenage')

In [25]:
df2

      Name  Age         City Gender              Email   Join Date Age group
0    Alice   25     New York      F  alice@example.com  01-05-2021     Adult
1  Charlie   25        Delhi      M    charlie@example  20-07-2021     Adult
2      Bob   25  Los Angeles      M    bob@example.com  15-06-2020     Adult
3  Charlie   25        Delhi      M    charlie@example  20-07-2021     Adult
4    David   25       Mumbai      M  david@example.com  12-11-2019     Adult
6    Alice   25     New York      F  alice@example.com  01-05-2021     Adult
7    Alice   25     New York      F  alice@example.com  01-05-2021     Adult
8  Charlie   25        Delhi      M    charlie@example  20-07-2021     Adult

In [26]:
df2['Gender'] = df2['Gender'].replace({"F":'Female','M':'Male'})

In [27]:
df2

      Name  Age         City  Gender              Email   Join Date Age group
0    Alice   25     New York  Female  alice@example.com  01-05-2021     Adult
1  Charlie   25        Delhi    Male    charlie@example  20-07-2021     Adult
2      Bob   25  Los Angeles    Male    bob@example.com  15-06-2020     Adult
3  Charlie   25        Delhi    Male    charlie@example  20-07-2021     Adult
4    David   25       Mumbai    Male  david@example.com  12-11-2019     Adult
6    Alice   25     New York  Female  alice@example.com  01-05-2021     Adult
7    Alice   25     New York  Female  alice@example.com  01-05-2021     Adult
8  Charlie   25        Delhi    Male    charlie@example  20-07-2021     Adult

In [2]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'Age': [22, 28, 35, 19]})

# If Age is 25 or more, assign 'Adult', otherwise 'Young'
df['Group'] = np.where(df['Age'] >= 25, 'Adult', 'Young')

#  Clean code
#  Super fast processing (thanks to NumPy!)
#  Perfect for creating new columns based on conditions


# Now we only want the rows where Age is 25 or more!
adults = df.query('Age >= 25')
print(adults)
#  Doesn't that look clean and elegant?

   Age  Group
1   28  Adult
2   35  Adult

In [ ]:
# Now we only want the rows where Age is 25 or more!
adults = df.query('Age >= 25')

#  Doesn't that look clean and elegant?